{% extends "layouts/main.volt" %}
{% block content %}
<div class="max-w-5xl mx-auto mt-24 px-4">
    <!-- Title -->
    <h1 class="text-3xl font-bold text-gray-900 notosan mt-6">นโยบายคุ้มครองข้อมูลส่วนบุคคล ห้องซ้อม.com</h1>
    <h2 class="mt-2 text-xl font-semibold text-gray-800 notosan">สำหรับผู่ใช้บริการจองห้องดนตรี</h2>
    <p class="italic text-gray-600">{{ t('index.privacy_policy_students') }}</p>
    <p class="mt-6 text-sm text-gray-500">
        อัพเดตเมื่อวันที่
        <time datetime="2025-01-01" class="font-medium text-gray-700">01 มกราคม 2568</time>
    </p>

    <!-- Introduction -->
    <p class="mt-6 text-base leading-relaxed text-gray-800">
        บริษัท เดอะกู้ดเชฟเพิร์ด จำกัด ทะเบียนนิติบุคคลเลขที่ 0135561012206 สำนักงานแห่งใหญ่ตั้งอยู่เลขที่
        56/203 หมู่ที่ 2 ตำบลคูคต อำเภอลำลูกกา จังหวัดปทุมธานี (ในเอกสารนี้เรียกว่า “บริษัท” หรือ “เรา”)
        ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคลของท่านเพื่อการใช้บริการของเราโดยเรามีความจำเป็นต้องประมวลผลข้อมูลส่วนบุคคลของผู้ใช้บริการ
        ดังนั้น เราจึงมีจุดประสงค์ประกาศนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ขึ้น เพื่อแจ้ง เกี่ยวกับ สิทธิและหน้าที่
        รวมถึงเงื่อนไขต่างๆ อันเกี่ยวเนื่องกับการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลที่บริษัท
        จะดำเนินการให้ท่านในฐานะผู้ใช้บริการรับทราบ เราให้ความเชื่อมั่นแก่ท่านว่า
        ข้อมูลส่วนบุคคลทั้งหมดของท่านเป็นข้อมูลที่ทางเราให้ความสำคัญ
        โดยเรารับประกันจะปกป้องและประมวลผลข้อมูลส่วนบุคคลด้วยมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสมอย่างดีที่สุด
        และข้อมูลทั้งหมดของท่านจะถูกเก็บรักษาเป็นความลับ
        โดยเราขอแนะนำให้ท่านโปรดอ่านและทำความเข้าใจนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้
        เพื่อรับทราบวัตถุประสงค์ที่เราได้เก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
        ตลอดจนสิทธิของเจ้าของข้อมูลส่วนบุคคลต่อท่าน โดยมีรายละเอียด ดังต่อไปนี้
    </p>

    <!-- Section 1 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 1. ขอบเขตการใช้บังคับ</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        นโยบายคุ้มครองข้อมูลส่วนบุคคล (Privacy Policy) ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ฉบับนี้
        มีขอบเขตการบังคับใช้ครอบคลุมการประมวลผลข้อมูลส่วนบุคคลทั้งหมดที่ดำเนินการโดยเรา รวมถึงบุคคลใด ๆ
        ซึ่งล่วงรู้ข้อมูลส่วนบุคคลเนื่องจากเกี่ยวข้องกับการดำเนินงานของเรา
        ซึ่งจะต้องปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ และตามกรอบที่กฎหมายกำหนด
    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        สำหรับข้อมูลส่วนบุคคลที่ได้เก็บรวบรวมไว้ก่อนที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ใช้บังคับ
        เราสามารถเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลนั้นได้ต่อไปตามวัตถุประสงค์เดิม
        โดยการเปิดเผยและการดำเนินการอื่นที่ไม่ใช่การเก็บรวบรวมและการใช้ข้อมูลส่วนบุคคลข้างต้นให้ปฏิบัติตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
        พ.ศ. 2562
    </p>

    <!-- Section 2 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 2. คำจำกัดความ</h3>
    <dl class="mt-4 space-y-6 text-gray-800">
        <div>
            <dt class="font-semibold">“นโยบายคุ้มครองข้อมูลส่วนบุคคล”</dt>
            <dd class="mt-1 ml-4">
                หมายความว่า นโยบาย ที่เราจัดทำเพื่อแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบถึงการประมวลผลข้อมูลของเรา
                และรายละเอียดต่าง ๆ ตามที่พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ได้กำหนดไว้
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“ข้อมูลส่วนบุคคล”</dt>
            <dd class="mt-1 ml-4">
                หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ ไม่ว่าทางตรงหรือทางอ้อม
                แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ อย่างไรก็ดี ข้อมูลต่อไปนี้ไม่ใช่ข้อมูลส่วนบุคคล เช่น
                ข้อมูลสำหรับการติดต่อทางธุรกิจที่ไม่ได้ระบุถึงตัวบุคคล อาทิ ชื่อบริษัท ที่อยู่ของบริษัท
                เลขทะเบียนนิติบุคคลของบริษัท หมายเลขโทรศัพท์ของที่ทำงาน อีเมลแอดเดรส (email address)
                ที่ใช้ในการทำงาน เช่น info@company.co.th ข้อมูลนิรนาม (Anonymous Data)
                หรือข้อมูลแฝงที่ถูกทำให้ไม่สามารถระบุตัวบุคคลได้อีกโดยวิธีการทางเทคนิค (Pseudonymous Data)
                ข้อมูลผู้ถึงแก่กรรม เป็นต้น
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“ข้อมูลส่วนบุคคลที่มีความอ่อนไหว”</dt>
            <dd class="mt-1 ml-4">
                (Sensitive data) หมายความว่า ข้อมูลส่วนบุคคลเกี่ยวกับเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง
                ความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ
                ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ
                หรือข้อมูลอื่นใดซึ่งกระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
                ทั้งนี้ ต่อไปในนโยบายฉบับนี้ หากไม่มีการกล่าวโดยเฉพาะเจาะจงจะเรียก “ข้อมูลส่วนบุคคล” และ
                “ข้อมูลส่วนบุคคลที่มีความอ่อนไหว” ที่เกี่ยวกับผู้ใช้บริการข้างต้นให้รวมกันเรียกว่า “ข้อมูลส่วนบุคคล”
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“การประมวลผล”</dt>
            <dd class="mt-1 ml-4">
                หมายความว่า การดำเนินการใด ๆ กับข้อมูลส่วนบุคคล เช่น การเก็บรวบรวม บันทึก จัดระบบ ทำโครงสร้าง
                เก็บรักษา ปรับปรุง เปลี่ยนแปลง กู้คืน ใช้ เปิดเผย ส่งต่อ เผยแพร่ โอน ผสมเข้าด้วยกัน ลบ ทำลาย
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“เจ้าของข้อมูลส่วนบุคคล” (Data Subject)</dt>
            <dd class="mt-1 ml-4">
                หมายความว่า บุคคลธรรมดาซึ่งเป็นเจ้าของข้อมูลส่วนบุคคล
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“ผู้ควบคุมข้อมูลส่วนบุคคล” (Data Controller)</dt>
            <dd class="mt-1 ml-4">
                หมายความว่า บุคคลหรือนิติบุคคลอื่นซึ่งมีอำนาจหน้าที่ตัดสินใจเกี่ยวกับการเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคล
            </dd>
        </div>
    </dl>
    <!-- Continued Definitions -->
    <dl class="mt-8 space-y-6 text-gray-800">
        <div>
            <dt class="font-semibold">“ผู้ประมวลผลข้อมูลส่วนบุคคล” (Data Processor)</dt>
            <dd class="mt-1 ml-4 leading-relaxed">
                หมายความว่า บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้
                หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล ทั้งนี้
                บุคคลหรือนิติบุคคลที่ดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“คุกกี้” (Cookies)</dt>
            <dd class="mt-1 ml-4 leading-relaxed">
                หมายความว่า ไฟล์คอมพิวเตอร์ขนาดเล็ก
                ที่จะเก็บข้อมูลส่วนบุคคลชั่วคราวที่จำเป็นลงในเครื่องคอมพิวเตอร์ของเจ้าของข้อมูลส่วนบุคคล
                เพื่อความสะดวกและรวดเร็วในการติดต่อสื่อสารซึ่งจะมีผลในขณะที่เข้าใช้งานระบบเว็บไซต์เท่านั้น
            </dd>
        </div>
        <div>
            <dt class="font-semibold">“บริการของเรา”</dt>
            <dd class="mt-1 ml-4 leading-relaxed">
                หมายความว่า บริการจับคู่ผู้ที่ต้องการจองห้องดนตรีกับผู้ให้บริการห้องดนตรีโดยผ่านแพลตฟอร์มดิจิทัล และบริการอื่น ๆ
                ที่เกี่ยวข้อง
            </dd>
        </div>
    </dl>

    <!-- Section 3 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 3. ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</h3>

    <div class="ml-4">
        <p class="mt-4 text-base text-gray-800">3.1 เราอาจเก็บรวบรวมข้อมูลส่วนบุคคลดังต่อไปนี้</p>

        <ol class="mt-4 list-decimal list-inside space-y-4 text-gray-800">
            <li>
                ข้อมูลส่วนตัว ได้แก่ คำนำหน้าชื่อ ชื่อเต็ม ชื่อเล่น เพศ อายุ อาชีพ คุณสมบัติ ตำแหน่งงาน
                ตำแหน่งหรือฐานะ ประเภทธุรกิจ สัญชาติ ประเทศที่พำนัก วันเดือนปีเกิด สถานภาพทางการสมรส
                ข้อมูลบนบัตรที่ออกโดยหน่วยงานราชการ (เช่น เลขที่บัตรประจำตัวประชาชน หมายเลขประกันสังคม
                หมายเลขหนังสือเดินทาง เลขประจำตัวผู้เสียภาษีอากร ข้อมูลใบอนุญาตขับขี่รถยนต์
                หรือเอกสารระบุตัวตนที่มีลักษณะเดียวกัน เป็นต้น) ทะเบียนบ้าน ลายมือชื่อ เสียง บันทึกเสียง รูป ภาพ
                รูปถ่าย บันทึกวิดีโอ ข้อมูลการตรวจสอบตัวตน (KYC/e-KYC) และข้อมูลส่วนตัวอื่น ๆ ที่ท่านได้มอบให้แก่เรา
                เป็นต้น
            </li>
            <li>
                รายละเอียดในการติดต่อ ได้แก่ ที่อยู่ รายละเอียดในการจัดส่ง รายละเอียดในการเรียกเก็บเงิน
                ที่อยู่สำหรับส่งใบแจ้งหนี้ หมายเลขโทรศัพท์ หมายเลขโทรศัพท์เคลื่อนที่ หมายเลขโทรสาร
                หมายเลขโทรศัพท์ที่ทำงาน อีเมล
            </li>
            <li>
                ข้อมูลทางการเงิน ได้แก่ ข้อมูลบัตรเครดิต/เดบิตหรือข้อมูลทางธนาคาร หมายเลขบัตรเครดิต/เดบิต
                ประเภทของบัตรเครดิต วันที่ออกบัตร/วันหมดอายุ รอบบิล รายละเอียดบัญชี รายละเอียดและประวัติการชำระเงิน
                และข้อมูลทางการเงินอื่น ๆ
            </li>
            <li>
                ข้อมูลทางการตลาดและการติดต่อสื่อสาร เช่น ความต้องการของท่านในการรับข้อมูลทางการตลาดจากเรา
                พันธมิตรทางธุรกิจ หรือบริษัทอื่น ๆ และรูปแบบการติดต่อสื่อสารที่ต้องการ รายการสินค้าที่สนใจ
                บันทึกการแจ้งเตือนเกี่ยวกับโปรโมชั่นสินค้าหรือบริการ และข้อมูลทางการตลาดและการติดต่อสื่อสารอื่น ๆ
                รวมถึง ข้อมูลการใช้เว็บไซต์ แพลตฟอร์ม สินค้า และบริการของลูกจ้าง บันทึกถาม-ตอบ
            </li>
            <li>
                รายละเอียดโปรไฟล์ เช่น ชื่อผู้ใช้และรหัสผ่าน โปรไฟล์ การใช้จ่าย
                รายละเอียดเกี่ยวกับผลิตภัณฑ์หรือบริการ (ประวัติคำสั่ง การสั่งซื้อที่ผ่านมา ประวัติการซื้อ
                การยกเลิกคำสั่งซื้อลูกค้า คำสั่งซื้อผ่านทางเว็บไซต์ รหัสคำสั่งซื้อ) บันทึกทางการเงิน
                หมายเลขยืนยันตัวตน (PIN) ผลตอบรับและผลการตอบแบบสำรวจ ผลสำรวจความพึงพอใจ รายละเอียดการเข้าร่วมกิจกรรม
                การใช้รหัสส่วนลดและโปรโมชันสำหรับลูกค้า รายละเอียดคำสั่งซื้อของลูกค้า การบริการลูกค้า เป็นต้น
            </li>
        </ol>
        <!-- Section 3 continued -->
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            3.2 เราไม่มีนโยบายในการเก็บรวบรวมข้อมูลส่วนบุคคลที่มีความอ่อนไหว (Sensitive Data) จากท่าน อย่างไรก็ดี
            หากมีกรณีที่เราจำเป็นจะต้องเก็บรวบรวมข้อมูลส่วนบุคคลดังกล่าว
            เราจะขอความยินยอมจากท่านโดยชัดแจ้งก่อนการดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลดังกล่าว
            หรือเว้นแต่มีเหตุตามกฎหมายให้ดำเนินการเก็บรวบรวมข้อมูลดังกล่าวได้โดยไม่ต้องขอความยินยอม
        </p>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            3.3 ท่านตกลงจะไม่ส่งมอบข้อมูลใดๆ ที่ไม่ถูกต้องและ/หรือที่ทำให้เข้าใจผิดแก่เรา
            และท่านตกลงจะแจ้งให้เราทราบถึงความไม่ถูกต้องหรือการเปลี่ยนแปลงของข้อมูลนั้น
            เราสงวนสิทธิ์ที่จะขอให้ส่งมอบเอกสารเพิ่มเติมอื่นใดเพื่อการยืนยันข้อมูลที่คุณได้ให้แก่เราตามที่เราเห็นสมควร
        </p>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            3.4 หากท่านได้ให้ข้อมูลส่วนบุคคลของบุคคลที่สามแก่เรา (เช่น เจ้าของทรัพย์สิน ผู้รับผลประโยชน์
            ผู้ติดต่อฉุกเฉิน บุคคลที่อ้างอิง และผู้อ้างอิง) เช่น ชื่อ นามสกุล ที่อยู่ หมายเลขโทรศัพท์
            รายได้ของบุคคลในครอบครัว และข้อมูลส่วนตัวและข้อมูลเพื่อการติดต่ออื่นเพื่อติดต่อในกรณีฉุกเฉิน
            กรอกใบสมัครหรือทำธุรกรรมของท่านกับเรา ท่านรับรองว่าข้อมูลดังกล่าวเป็นข้อมูลที่ถูกต้องตามกฎหมาย
            กรุณาแจ้งบุคคลเหล่านั้นให้ทราบถึงนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้
            และ/หรือขอความยินยอมจากบุคคลเหล่านั้น
        </p>
    </div>

    <!-- Section 4 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 4. แหล่งที่มาของข้อมูลส่วนบุคคลที่เราเก็บรวบรวม
    </h3>
    <p class="mt-4 text-base text-gray-800">
        เราเก็บรวบรวมหรือได้มาซึ่งข้อมูลส่วนบุคคลประเภทต่าง ๆ จากแหล่งข้อมูลดังต่อไปนี้
    </p>

    <div class="ml-4">
        <!-- Subsection 4.1 -->
        <h4 class="mt-6 text-lg font-semibold text-gray-700 notosan">4.1 การเก็บรวบรวมจากท่านโดยตรง</h4>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            ข้อมูลส่วนบุคคลที่เราเก็บรวบรวมจากเจ้าของข้อมูลส่วนบุคคลโดยตรงในช่องทางให้บริการต่าง ๆ เช่น
        </p>
        <ol class="mt-4 list-decimal list-inside space-y-3 text-gray-800">
            <li>เมื่อท่านได้เข้าถึง และ/หรือ สมัครเข้าใช้บริการ และ/หรือ สมัครเข้าเป็นผู้ให้บริการ
                หรือใช้บริการของเรา หรือลงทะเบียนสมัครบัญชีผู้ใช้กับเรา อย่างหนึ่งอย่างใด</li>
            <li>เมื่อท่านส่งแบบฟอร์ม รวมถึงแต่ไม่จำกัดเพียง แบบฟอร์มการสมัครหรือแบบฟอร์มอื่นๆ
                ที่เกี่ยวข้องกับผลิตภัณฑ์และบริการของเรา ไม่ว่าจะแบบออนไลน์หรือแบบฟอร์มเป็นเอกสาร</li>
            <li>เมื่อท่านทำข้อตกลงใดๆ
                หรือให้เอกสารหรือข้อมูลอื่นใดที่เกี่ยวข้องกับการติดต่อระหว่างท่านกับเราหรือเมื่อท่านใช้ผลิตภัณฑ์และบริการของเรา
            </li>
            <li>เมื่อท่านติดต่อกับเรา เช่น ผ่านทางโทรศัพท์ (ซึ่งจะได้รับการบันทึก) จดหมาย แฟกซ์
                การประชุมแบบเห็นหน้ากัน แพลตฟอร์มสื่อทางสังคม และอีเมลแอดเดรส
                รวมถึงเมื่อท่านได้ติดต่อกับตัวแทนให้บริการลูกค้า (customer service agents) ของเรา</li>
            <li>เมื่อท่านใช้บริการทางอิเล็กทรอนิกส์ หรือติดต่อกับเราผ่านแพลตฟอร์ม เว็บไซต์ แอปพลิเคชัน หรือใช้บริการ
                ซึ่งรวมถึงแต่ไม่จำกัดเพียงการใช้ผ่านคุกกี้
                ซึ่งเราอาจปรับใช้เมื่อท่านใช้หรือเข้าถึงแอปพลิเคชันหรือเว็บไซต์</li>
            <li>เมื่อท่านได้อนุญาตโดยผ่านอุปกรณ์ของท่าน ให้เปิดเผยข้อมูลใดๆ แก่แอปพลิเคชันหรือแพลตฟอร์มของเรา</li>
            <li>เมื่อท่านเชื่อมโยงบัญชีผู้ใช้บริการผ่านแพลตฟอร์มของเรากับบัญชีสื่อสังคมออนไลน์ (Social Media
                Account) หรือบัญชีผู้ใช้งานอื่นของท่าน หรือใช้ฟีเจอร์สื่อสังคมออนไลน์อื่น (Social Media Features)
                ภายใต้นโยบายการให้บริการของผู้ให้บริการฟีเจอร์นั้นๆ</li>
            <li>เมื่อท่านดำเนินธุรกรรมผ่านบริการของเรา</li>
            <li>เมื่อท่านให้ความคิดเห็นหรือคำร้องเรียนแก่เรา</li>
            <li>เมื่อท่านได้ให้บริการที่ได้รับการจองผ่านบริการของเรา</li>
            <li>ข้อมูลที่เราเก็บรวบรวมจากการที่เจ้าของข้อมูลส่วนบุคคลเข้าใช้งานเว็บไซต์ ผลิตภัณฑ์หรือบริการอื่น ๆ
                ตามสัญญาหรือตามพันธกิจ เช่น การติดตามพฤติกรรมการใช้งานเว็บไซต์
                ผลิตภัณฑ์หรือบริการของเราด้วยการใช้คุกกี้ (Cookies)
                หรือจากซอฟต์แวร์บนอุปกรณ์ของเจ้าของข้อมูลส่วนบุคคล เป็นต้น</li>
            <li>เมื่อท่านส่งข้อมูลส่วนบุคคลของคุณให้แก่เราด้วยเหตุผลใดก็ตาม เป็นต้น</li>
        </ol>
        <!-- Subsection 4.2 -->
        <h4 class="mt-8 text-lg font-semibold text-gray-700 notosan">4.2 การเก็บรวบรวมข้อมูลส่วนบุคคลจากแหล่งอื่น
        </h4>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            การเก็บรวบรวมข้อมูลส่วนบุคคลจากแหล่งอื่น เช่น ข้อมูลสาธารณะ และ/หรือ บริษัทแม่และบริษัทในเครือ (เช่น การได้รับข้อมูลจากผู้ให้บริการที่เราว่าจ้างให้เก็บรวบรวมข้อมูลส่วนบุคคลแทน) พันธมิตรทางธุรกิจของเรา หน่วยงานที่เราให้บริการ (รวมทั้ง เว็บไซต์ ตลอดจนชื่อผู้ใช้เครือข่ายสังคมออนไลน์ของหน่วยงานดังกล่าว) แหล่งข้อมูลของทางการ หน่วยงาน ของรัฐที่มีฐานข้อมูลที่น่าเชื่อถือเกี่ยวกับบุคคล หน่วยงานภาครัฐ (เช่น สำนักงานตำรวจแห่งชาติ บริษัท ข้อมูลเครดิตแห่งชาติ จำกัด ธนาคารแห่งประเทศไทย กรมสรรพากร สำนักงานป้องกันและปราบปรามการฟอกเงิน สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย กรมบังคับคดี กระทรวงพาณิชย์ สำนักงานคณะกรรมการกำกับหลักทรัพย์และตลาดหลักทรัพย์ กรมที่ดิน ศาล) และจากบุคคลภายนอกอื่นใด (เช่น ผู้ที่แนะนำลูกค้า ผู้แทนของท่าน ผู้ค้า หรือบุคคลอื่นใดซึ่งได้รับมอบอำนาจจากท่าน)
        </p>

        <p class="mt-4 text-base leading-relaxed text-gray-800">
            แพลตฟอร์มของเราใช้ Google Analytics ซึ่งเป็นบริการวิเคราะห์เว็บที่ให้บริการโดย Google, Inc. (“Google”) Google Analytics ใช้คุกกี้ ซึ่งเป็นไฟล์ข้อความที่เก็บไว้ในคอมพิวเตอร์ของคุณเพื่อช่วยเว็บแพลตฟอร์มวิเคราะห์วิธีการใช้งานของผู้ใช้ ข้อมูลที่คุกกี้สร้างขึ้นเกี่ยวกับการใช้งานเว็บแพลตฟอร์ม (รวมถึงที่อยู่ IP ของคุณ) จะถูกส่งและจัดเก็บบนเซิร์ฟเวอร์โดย Google ในประเทศสหรัฐอเมริกา Google จะใช้ข้อมูลนี้เพื่อประเมินการใช้งานเว็บแพลตฟอร์ม รวบรวมรายงานเกี่ยวกับกิจกรรมที่เกิดขึ้นในเว็บแพลตฟอร์มสำหรับผู้ให้บริการเว็บแพลตฟอร์ม และให้บริการด้านอื่น ๆ ที่เกี่ยวข้องกับกิจกรรมของเว็บแพลตฟอร์มและการใช้งานอินเทอร์เน็ต Google ยังอาจส่งข้อมูลนี้ให้แก่บุคคลภายนอกตามที่กฎหมายได้กำหนดไว้ หรือเมื่อบุคคลภายนอกดังกล่าวดำเนินการประมวลผลข้อมูลในนามของ Google โดยที่ Google จะไม่เชื่อมโยงที่อยู่ IP ของคุณกับข้อมูลอื่นที่ Google เก็บรักษาไว้
        </p>
    </div>

    <!-- Section 5 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 5. คุณภาพของข้อมูล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เรามีการจัดเก็บข้อมูลส่วนบุคคลของท่าน เพื่อนำไปใช้ประโยชน์ในการดำเนินงานตามวัตถุประสงค์และพันธกิจของเรา ระหว่างท่านกับเรา โดยข้อมูลที่ได้ทำการจัดเก็บนั้น เราได้คำนึงถึงความถูกต้อง ครบถ้วน และความเป็นปัจจุบันของข้อมูล
    </p>

    <!-- Section 6 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 6. วัตถุประสงค์และฐานทางกฎหมายในการประมวลผลข้อมูล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
       เราอาจเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของท่านโดยมีวัตถุประสงค์และฐานทางกฎหมายในการประมวลผลข้อมูลดังต่อไปนี้
    </p>
    <!-- Section 6 continued: Objectives & Legal Basis -->
    <table class="w-full bg-white border-1 border-gray-200 divide-y divide-gray-200">
        <thead class="bg-gray-200">
            <tr>
                <th class="px-6 py-3 text-left text-lg font-bold text-gray-900 notosan" width="50%">วัตถุประสงค์
                </th>
                <th class="px-6 py-3 text-left text-lg font-semibold text-gray-700 notosan">
                    ฐานทางกฎหมายในการประมวลผล</th>
            </tr>
        </thead>
        <tbody>
            <!-- 1 -->
            <tr class="border-1 border-gray-200 hover:bg-gray-50">
                <td class="px-6 py-4 align-top text-gray-900">
                    1. เพื่อใช้ในการยืนยันตัวตนของท่านต่อผู้ให้บริการห้องดนตรีที่ท่านประสงค์จองด้วย
                </td>
                <td class="px-6 py-4 text-gray-800">
                    <p>การประมวลผลข้อมูลส่วนบุคคลของท่านถือเป็นสิ่งจำเป็นเพื่อ</p>
                    <ul class="mt-2 list-disc list-inside space-y-1">
                        <li>ประโยชน์โดยชอบด้วยกฎหมายของเรา ของท่านเอง หรือของบุคคล หรือนิติบุคคลอื่น</li>
                        <li>การปฎิบัติตามสัญญาซึ่งท่านเป็นคู่สัญญา</li>
                    </ul>
                </td>
            </tr>
            <!-- 2 -->
            <tr class="border-1 border-gray-200 hover:bg-gray-50">
                <td class="px-6 py-4 align-top text-gray-900">
                    2. เพื่อการดำเนินการใด ๆ อันจำเป็นเพื่อให้ท่านเข้าใช้บริการของเราได้
                </td>
                <td class="px-6 py-4 text-gray-800">
                    <p>การประมวลผลข้อมูลส่วนบุคคลของท่านถือเป็นสิ่งจำเป็นเพื่อ</p>
                    <ul class="mt-2 list-disc list-inside space-y-1">
                        <li>ประโยชน์โดยชอบด้วยกฎหมายของเรา ของท่านเอง หรือของบุคคล หรือนิติบุคคลอื่น</li>
                        <li>การปฎิบัติตามสัญญาซึ่งท่านเป็นคู่สัญญา</li>
                    </ul>
                </td>
            </tr>
            <!-- 3 -->
            <tr class="border-1 border-gray-200 hover:bg-gray-50">
                <td class="px-6 py-4 align-top text-gray-900">
                    3. เพื่อการติดต่อสื่อสาร การสื่อสารทางการตลาด การวิเคราะห์ข้อมูลเชิงลึก การพัฒนาบริการของเรา เพื่อการให้ความช่วยเหลือเกี่ยวกับคำขอใช้บริการ ข้อซักถาม หรือข้อเสนอแนะของท่าน และเพื่อทำให้แน่ใจว่ากลุ่มเราจะสามารถให้บริการแก่ท่านและบุคคลอื่นได้อย่างมีประสิทธิภาพ
                </td>
                <td class="px-6 py-4 text-gray-800">
                    <p>การประมวลผลข้อมูลส่วนบุคคลของท่านถือเป็นสิ่งจำเป็นเพื่อ</p>
                    <ul class="mt-2 list-disc list-inside space-y-1">
                        <li>เพื่อประโยชน์อันชอบด้วยกฎหมายของเรา หรือของบุคคล หรือนิติบุคคลอื่นนอกเหนือไปจากเราหรือ</li>
                        <li>เพื่อให้บรรลุวัตถุประสงค์เกี่ยวกับการศึกษาวิจัยหรือสถิติ</li>
                    </ul>
                </td>
            </tr>
            <!-- 4 -->
            <tr class="border-1 border-gray-200 hover:bg-gray-50">
                <td class="px-6 py-4 align-top text-gray-900">
                    4. เพื่อวัตถุประสงค์อื่น ๆ ที่เราจะได้แจ้งให้ท่านทราบ ณ เวลาที่ได้เก็บรวบรวมข้อมูลส่วนบุคคล เราจะแจ้งให้ท่านทราบถึงวัตถุประสงค์อื่นใดอันเป็นเหตุให้เราต้องการใช้ข้อมูลส่วนบุคคลของท่านนอกเหนือไปจากวัตถุประสงค์ตามที่ระบุไว้ข้างต้น หรือเมื่อเราประสงค์ที่จะให้มีการเปลี่ยนแปลงวัตถุประสงค์เดิมที่กำหนดไว้ หรือเมื่อเรามีความจำเป็นต้องขอความยินยอมเพื่อการประมวลผลข้อมูลส่วนบุคคลเป็นการเฉพาะจากท่าน โดยการติดต่อท่านผ่านข้อมูลติดต่อที่ท่านได้ให้เราไว้
                </td>
                <td class="px-6 py-4 text-gray-800">
                    <!-- No additional list for this item -->
                </td>
            </tr>
        </tbody>
    </table>

    <!-- Section 7 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 7. การประมวลผลข้อมูลส่วนบุคคล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
       เราจะดำเนินการประมวลผลข้อมูลส่วนบุคคลของท่าน โดยจะกระทำโดยมีวัตถุประสงค์ ขอบเขต และใช้วิธีการที่ชอบด้วยกฎหมาย โปร่งใส และเป็นธรรม ภายใต้ฐานการประมวลผล ดังต่อไปนี้
    </p>

    <div class="ml-4">
        <h4 class="notosan mt-6 text-lg font-semibold text-gray-700">7.1 การเก็บรวบรวมข้อมูลส่วนบุคคล</h4>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            การเก็บรวบรวมข้อมูลส่วนบุคคล ให้กระทำได้ภายใต้วัตถุประสงค์ และเพียงเท่าที่จำเป็นตามกรอบวัตถุประสงค์ หรือ เพื่อประโยชน์ที่มีความเกี่ยวข้องโดยตรงกับวัตถุประสงค์ในการเก็บรวบรวม โดยต้องแจ้งให้เจ้าของข้อมูลส่วนบุคคลทราบก่อนหรือในขณะเก็บรวบรวมข้อมูลส่วนบุคคลถึงรายละเอียดดังต่อไปนี้
        </p>
        <ol class="mt-4 list-decimal list-inside space-y-2 text-gray-800">
            <li>วัตถุประสงค์ของการเก็บรวบรวม</li>
            <li>ข้อมูลส่วนบุคคลที่ทำการเก็บรวบรวม</li>
            <li>กรณีที่เจ้าของข้อมูลส่วนบุคคลต้องให้ข้อมูลส่วนบุคคล เพื่อปฏิบัติตามกฎหมายหรือสัญญา หรือเพื่อเข้าทำสัญญา โดยต้องแจ้งถึงผลกระทบที่เป็นไปได้จากการไม่ให้ข้อมูลส่วนบุคคลให้เจ้าของข้อมูลส่วนบุคคลทราบ</li>
            <li>ประเภทของบุคคลหรือหน่วยงานซึ่งข้อมูลส่วนบุคคลที่เก็บรวบรวมอาจถูกเปิดเผย</li>
            <li>สิทธิของเจ้าของข้อมูลส่วนบุคคล</li>
        </ol>
        <!-- 7.2 การใช้ข้อมูลส่วนบุคคล -->
        <h4 class="notosan mt-8 text-lg font-semibold text-gray-700">7.2 การใช้ข้อมูลส่วนบุคคล</h4>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            เราจะใช้ข้อมูลส่วนบุคคลในกรณีที่พิจารณาแล้วเห็นว่าเป็นประโยชน์ต่อท่าน หรือการดำเนินธุรกิจของเรา เพื่อให้ท่านได้รับบริการที่ดีจากการดำเนินธุรกิจของเรา ทั้งนี้ เราจะใช้ข้อมูลส่วนบุคคลให้เป็นไปตามกฎหมายและกฎเกณฑ์ต่าง ๆ ที่เกี่ยวข้องหรือเพื่อปรับปรุงบริการให้ประสิทธิภาพมากขึ้น รวมถึงเป็นไปตามวัตถุประสงค์ที่ได้แจ้งให้ท่านทราบตามนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ เพื่อพัฒนามาตรฐานความมั่นคงปลอดภัยสารสนเทศในการบริหารความเสี่ยง ตรวจจับ ป้องกันกิจกรรมที่มีแนวโน้มละเมิดกฎหมาย ระเบียบการใช้งานที่เกี่ยวข้องหรือข้อตกลง เงื่อนไขการใช้เว็บไซต์หรือแอพพลิเคชันของเรา รวมถึงเพื่อติดต่อท่านผ่านทางโทรศัพท์ ข้อความ (SMS) อีเมลแอดเดรส หรือไปรษณีย์ หรือผ่านช่องทางใด ๆ เพื่อสอบถาม หรือแจ้งให้ท่านทราบ หรือตรวจสอบและยืนยันข้อมูล หรือสำรวจความคิดเห็น หรือแจ้งข้อมูลข่าวสารอื่นใดที่เกี่ยวข้องกับผลิตภัณฑ์ และการให้บริการของเราตามที่จำเป็น
        </p>

        <!-- 7.3 การเปิดเผยข้อมูลส่วนบุคคล -->
        <h4 class="notosan mt-8 text-lg font-semibold text-gray-700">7.3 การเปิดเผยข้อมูลส่วนบุคคล</h4>
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            เราจะเปิดเผยข้อมูลส่วนบุคคลของท่านให้แก่บุคคลที่สาม เพื่อประโยชน์ในการเพิ่มประสิทธิภาพการให้บริการในด้านต่าง ๆ แก่ท่าน หรืออำนวยความสะดวกอื่นใดแก่ท่านได้อย่างถูกต้อง ต่อเนื่อง เพื่อให้ท่านสามารถทำธุรกรรมที่ท่านประสงค์ได้สำเร็จลุล่วง และเกิดประโยชน์สูงสุด โดยการเปิดเผยข้อมูลส่วนบุคคล ให้เป็นไปตามวัตถุประสงค์หรือเป็นการจำเป็นเพื่อประโยชน์ที่มีความเกี่ยวข้องโดยตรงกับวัตถุประสงค์ของการเก็บรวบรวม และต้องได้รับความยินยอมจากเจ้าของข้อมูลที่ให้ไว้ก่อนหรือในขณะนั้น เว้นแต่ในกรณีดังต่อไปนี้ ไม่จำเป็นต้องขอความยินยอม
        </p>
        <ol class="mt-4 list-decimal list-inside space-y-2 text-gray-800">
            <li>เพื่อประโยชน์เกี่ยวกับการวางแผนหรือการสถิติหรือสำมะโนต่าง ๆ ของหน่วยงานของรัฐ</li>
            <li>เพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกายหรือสุขภาพของบุคคล</li>
            <li>เป็นข้อมูลที่เปิดเผยต่อสาธารณะโดยชอบด้วยกฎหมาย</li>
            <li>เพื่อประโยชน์แก่การสืบสวนสอบสวนของพนักงานเจ้าหน้าที่ตามกฎหมาย หรือในการพิจารณาพิพากษาคดีของศาล</li>
            <li>เป็นการปฏิบัติตามที่กฎหมายกำหนด หรือตามคำสั่งศาล</li>
        </ol>

        <p class="mt-6 text-base leading-relaxed text-gray-800">
            เราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านให้แก่บุคคลที่สาม ไม่ว่าจะมีสภาพเป็นนิติบุคคล หรือบุคคลธรรมดา ภายใต้ขอบเขตที่จำเป็นตามวัตถุประสงค์ที่กำหนดไว้ในนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ ซึ่งอาจรวมถึง
        </p>
        <ul class="mt-4 list-disc list-inside space-y-2 text-gray-800">
            <li>บริษัทในเครือ คู่ค้า พันธมิตรทางธุรกิจ บริษัทย่อย และ/หรือ ผู้ให้บริการภายนอก เพื่อให้บริการในการนำเสนอสิทธิประโยชน์และบริการอื่น ๆ ของเราแก่เจ้าของข้อมูลส่วนบุคคล รวมถึงการพัฒนา ปรับปรุง ผลิตภัณฑ์ หรือบริการของเรา เช่น การวิเคราะห์ข้อมูล การประมวลผลข้อมูล การดำเนินการด้านบัตรเครดิต การให้บริการด้านเทคโนโลยีสารสนเทศและการจัดเตรียมโครงสร้างพื้นฐานที่เกี่ยวข้อง การพัฒนาแพลตฟอร์มบริการลูกค้า การส่งอีเมล/SMS การพัฒนาเว็บไซต์ การพัฒนาแอปพลิเคชันบนมือถือ และการรับประกันภัยต่อ การสำรวจความพึงพอใจและการทำวิจัย การบริหารความสัมพันธ์กับลูกค้าโดยจะมีการทำสัญญารักษาข้อมูลส่วนบุคคลไว้เป็นความลับ กรณีนิติบุคคลจะต้องมีมาตรฐานด้านความคุ้มครองข้อมูลส่วนบุคคลที่มีมาตรฐานเป็นที่ยอมรับ</li>
            <li>หน่วยงานรัฐบาล รัฐบาล หรือองค์กรอื่นตามกฎหมาย เพื่อเป็นการปฏิบัติตามกฎหมาย คำสั่ง คำร้องขอ เพื่อการประสานงานกับหน่วยงานต่าง ๆ ในเรื่องที่เกี่ยวข้องกับการปฏิบัติตามกฎหมาย</li>
        </ul>
        <!-- Reminder of protection measures -->
        <p class="mt-4 text-base leading-relaxed text-gray-800">
            ทั้งนี้ เราจะกำหนดให้ผู้ที่ได้รับข้อมูลมีมาตรการปกป้องข้อมูลของท่านอย่างเหมาะสมและประมวลผลข้อมูลส่วนบุคคลดังกล่าวเท่าที่จำเป็นเท่านั้น และดำเนินการเพื่อป้องกันไม่ให้ใช้หรือเปิดเผยข้อมูลส่วนบุคคลโดยปราศจากอำนาจโดยมิชอบ
        </p>
    </div>

    <!-- Section 8 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">
        ข้อ 8. ข้อจำกัดในการใช้และ/หรือเปิดเผยข้อมูลส่วนบุคคล
    </h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราจะใช้ เปิดเผยข้อมูลส่วนบุคคลของท่านได้ ตามความยินยอมของท่านโดยจะต้องเป็นการใช้ตามวัตถุประสงค์ของการเก็บรวบรวม จัดเก็บ ข้อมูลของเราเท่านั้น เราจะกำกับดูแลพนักงาน เจ้าหน้าที่หรือผู้ปฏิบัติงานของเรามิให้ใช้และ/หรือเปิดเผย ข้อมูลส่วนบุคคลของท่านนอกเหนือไปจากวัตถุประสงค์ของการเก็บรวบรวมข้อมูลส่วนบุคคลหรือเปิดเผยต่อบุคคลภายนอก เว้นแต่
    </p>

    <ol class="mt-4 list-decimal list-inside space-y-2 text-gray-800">
        <li>เป็นการปฏิบัติตามกฎหมาย เช่น พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พระราชบัญญัติการประกอบกิจการโทรคมนาคม พระราชบัญญัติป้องกันและปราบปรามการฟอกเงิน ประมวลกฎหมายแพ่งและอาญา ประมวลกฎหมายวิธีพิจารณาความแพ่งและอาญา เป็นต้น</li>
        <li>เป็นไปเพื่อประโยชน์แก่การสอบสวนของพนักงานสอบสวน หรือการพิจารณาพิพากษาคดีของศาล</li>
        <li>เพื่อประโยชน์ของท่าน และการขอความยินยอมไม่อาจกระทำได้ในเวลานั้น</li>
        <li>เป็นการจำเป็นเพื่อประโยชน์โดยชอบด้วยกฎหมายของเรา หรือของบุคคลหรือนิติบุคคลอื่นที่ไม่ใช่เรา</li>
        <li>เป็นการจำเป็นเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของบุคคล</li>
        <li>เป็นการจำเป็นเพื่อการปฏิบัติตามสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญาหรือเพื่อใช้ในการดำเนินการตามคำขอของเจ้าของข้อมูลส่วนบุคคลก่อนเข้าทำสัญญานั้น</li>
        <li>เพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวกับการจัดทำเอกสารประวัติศาสตร์หรือจดหมายเหตุ เพื่อประโยชน์สาธารณะ หรือเพื่อการศึกษา วิจัย การจัดทำสถิติ ซึ่งได้จัดให้มีมาตรการป้องกันที่เหมาะสม</li>
    </ol>
    <!-- External IT service providers -->
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราอาจใช้บริการสารสนเทศของผู้ให้บริการซึ่งเป็นบุคคลภายนอกเพื่อให้ดำเนินการเก็บรักษาข้อมูลส่วนบุคคล ซึ่งผู้ให้บริการนั้นจะต้องมีมาตรการรักษาความมั่นคงปลอดภัย โดยห้ามดำเนินการเก็บรวบรวม ใช้หรือเปิดเผยข้อมูลส่วนบุคคลนอกเหนือจากที่เรากำหนด
    </p>

    <!-- Section 9 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 9. การให้บริการโดยบุคคลที่สามหรือผู้ให้บริการช่วง</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราอาจมีการมอบหมายหรือจัดซื้อจัดจ้างบุคคลที่สาม (ผู้ประมวลผลข้อมูลส่วนบุคคล) ให้ทำการประมวลผลข้อมูลส่วนบุคคลแทนหรือในนามของเรา ซึ่งบุคคลที่สามดังกล่าวอาจเสนอบริการในลักษณะต่าง ๆ เช่น การเป็นผู้ดูแล (Hosting) รับงานบริการช่วง (Outsourcing) หรือเป็นผู้ให้บริการคลาวด์ (Cloud computing service/provider) หรือเป็นงานในลักษณะการจ้างทำของในรูปแบบอื่น
    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        การมอบหมายให้บุคคลที่สามทำการประมวลผลข้อมูลส่วนบุคคลในฐานะผู้ประมวลผลข้อมูลส่วนบุคคลนั้น เราจะจัดให้มีข้อตกลงระบุสิทธิและหน้าที่ของเราในฐานะผู้ควบคุมข้อมูลส่วนบุคคลและของบุคคลที่เรามอบหมายในฐานะผู้ประมวลผลข้อมูลส่วนบุคคล ซึ่งรวมถึงกำหนดรายละเอียดประเภทข้อมูลส่วนบุคคลที่เรามอบหมายให้ประมวลผล รวมถึงวัตถุประสงค์ ขอบเขตในการประมวลผลข้อมูลส่วนบุคคลและข้อตกลง อื่น ๆ ที่เกี่ยวข้อง ซึ่งผู้ประมวลผลข้อมูลส่วนบุคคลมีหน้าที่ประมวลผลข้อมูลส่วนบุคคลตามขอบเขตที่ระบุในข้อตกลงและตามคำสั่งของเราเท่านั้นโดยไม่สามารถประมวลผลเพื่อวัตถุประสงค์อื่นได้
    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ในกรณีที่ผู้ประมวลผลข้อมูลส่วนบุคคลมีการมอบหมายผู้ให้บริการช่วง (ผู้ประมวลผลช่วง) เพื่อทำการประมวลผลข้อมูลส่วนบุคคลแทนหรือในนามของผู้ประมวลผลข้อมูลส่วนบุคคล ดังนี้ เราจะกำกับให้ผู้ประมวลผลข้อมูลส่วนบุคคลจัดให้มีเอกสารข้อตกลงระหว่างผู้ประมวลผลข้อมูลส่วนบุคคลกับผู้ประมวลผลช่วง ในรูปแบบและมาตรฐานที่ไม่ต่ำกว่าข้อตกลงระหว่างเรากับผู้ประมวลผลข้อมูลส่วนบุคคล
    </p>

    <!-- Section 10 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 10. การส่งหรือโอนข้อมูลส่วนบุคคลไปต่างประเทศ
    </h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราอาจมีความจำเป็นต้องส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังบริษัทในเครือหรือบุคคลอื่นในต่างประเทศ หรือไปยังผู้รับข้อมูลอื่นซึ่งเป็นส่วนหนึ่งของการดำเนินธุรกิจตามปกติของเรา เช่น การส่งหรือโอน
ข้อมูลส่วนบุคคลไปเก็บไว้บน Server/Cloud ในประเทศต่าง ๆ ในกรณีที่จำเป็นเพื่อการปฏิบัติตามสัญญาซึ่งท่านเป็นคู่สัญญา หรือเป็นการกระทำตามสัญญาระหว่างเรากับบุคคลหรือนิติบุคคลอื่นเพื่อประโยชน์ของท่านหรือเพื่อใช้ในการดำเนินการตามคำขอของท่านก่อนเข้าทำสัญญา หรือเพื่อป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพของท่านหรือบุคคลอื่น เพื่อปฏิบัติตามกฎหมาย หรือเป็นการจำเป็นเพื่อดำเนินภารกิจเพื่อประโยชน์สาธารณะที่สำคัญ

    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        กรณีที่ประเทศปลายทางมีมาตรฐานเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลไม่เพียงพอ เราจะดูแลการส่งหรือโอนข้อมูลส่วนบุคคลให้เป็นไปตามที่กฎหมายกำหนด และจะดำเนินการให้มีมาตรการคุ้มครองข้อมูลส่วนบุคคลที่เห็นว่าจำเป็นและเหมาะสมสอดคล้องกับมาตรฐานการรักษาความลับ เช่น มีข้อตกลงรักษาความลับกับผู้รับข้อมูลในประเทศดังกล่าว หรือในกรณีที่ผู้รับข้อมูลเป็นบริษัทในเครือกิจการ/ธุรกิจเดียวกัน เราอาจเลือกใช้วิธีการดำเนินการให้มีนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่ได้รับการตรวจสอบและรับรองจากผู้มีอำนาจตามกฎหมายที่เกี่ยวข้องและจะดำเนินการให้การส่งหรือโอนข้อมูลส่วนบุคคลไปยังบริษัทในเครือกิจการ/ธุรกิจเดียวกันที่อยู่ต่างประเทศเป็นไปตามนโยบายคุ้มครองข้อมูลส่วนบุคคลดังกล่าวแทนการดำเนินการตามที่กฎหมายกำหนดไว้ก็ได้
    </p>

    <!-- Section 11 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 11. การเก็บรักษา และระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราจะเก็บรักษาข้อมูลส่วนบุคคลของท่านไว้ตามระยะเวลาที่จำเป็นในระหว่างที่ท่านเป็นลูกค้าหรือยังคงใช้บริการของเรา หรือตลอดระยะเวลาที่จำเป็นเพื่อให้บรรลุวัตถุประสงค์ที่เกี่ยวข้องในนโยบายฉบับนี้ ซึ่งอาจจำเป็นต้องเก็บรักษาไว้ต่อไปภายหลังจากนั้นหากมีกฎหมายกำหนดหรืออนุญาตไว้ เช่น จัดเก็บไว้ตามกฎหมายว่าด้วยการป้องกันและปราบปรามการฟอกเงิน จัดเก็บไว้เพื่อวัตถุประสงค์ในการพิสูจน์ตรวจสอบกรณีอาจเกิดข้อพิพาทภายในอายุความตามที่กฎหมายกำหนดเป็นระยะเวลาไม่เกิน 10 ปี ทั้งนี้ เราจะทำการลบหรือทำลายข้อมูลส่วนบุคคล หรือทำให้เป็นข้อมูลที่ไม่สามารถระบุถึงตัวตนของท่านได้เมื่อหมดความจำเป็นหรือสิ้นสุดระยะเวลาดังกล่าว
    </p>

    <!-- Section 12 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 12. มาตรการรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ความปลอดภัยของข้อมูลส่วนบุคคลของท่านเป็นสิ่งสำคัญสำหรับเราและเราได้นำมาตรการรักษาความปลอดภัยทางเทคนิคและการบริหารที่เหมาะสมมาใช้เพื่อปกป้องข้อมูลส่วนบุคคลจากการสูญหาย การเข้าถึงการใช้หรือการเปิดเผยโดยไม่ได้รับอนุญาต การใช้งานในทางที่ผิด การดัดแปลงเปลี่ยนแปลง และการทำลายโดยใช้เทคโนโลยีและขั้นตอนการรักษาความปลอดภัย เช่น การเข้ารหัสและการจำกัดการเข้าถึง เพื่อให้มั่นใจว่าบุคคลที่ได้รับอนุญาตเท่านั้นที่เข้าถึงข้อมูลส่วนบุคคลของท่านและบุคคลเหล่านี้ได้รับการฝึกอบรมเกี่ยวกับความสำคัญของการปกป้องข้อมูลส่วนบุคคล
    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราจัดให้มีมาตรการรักษาความปลอดภัยที่เหมาะสม เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข เปิดเผยข้อมูลส่วนบุคคลจากผู้ที่ไม่มีสิทธิหรือหน้าที่ที่เกี่ยวข้องกับข้อมูลส่วนบุคคลนั้น และจะจัดให้มีการทบทวนมาตรการดังกล่าวเมื่อมีความจำเป็นหรือเมื่อเทคโนโลยีเปลี่ยนแปลงไปเพื่อให้มีประสิทธิภาพในการรักษาความปลอดภัยที่เหมาะสม ทั้งนี้ เราจะไม่รับผิดชอบในกรณีความเสียหายใด ๆ อันเกิดจากการใช้หรือการเปิดเผยข้อมูลส่วนบุคคลต่อบุคคลที่สาม รวมถึงการละเลย หรือเพิกเฉยการออกจากระบบ (Log out) ที่เจ้าของข้อมูลได้เข้าใช้งานโดยการกระทำของเจ้าของข้อมูลหรือบุคคลอื่นซึ่งได้รับอนุญาตจากเจ้าของข้อมูล
    </p>
    <!-- Section 13 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 13. สิทธิของเจ้าของข้อมูล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ท่านมีสิทธิดังต่อไปนี้
    </p>
    <ol class="mt-4 list-decimal list-inside space-y-2 text-gray-800">
        <li>สิทธิในการเพิกถอนความยินยอมให้บริษัทประมวลผลข้อมูลส่วนบุคคลของท่าน</li>
        <li>สิทธิในการเข้าถึงและรับสำเนาข้อมูลส่วนบุคคลที่บริษัทได้เก็บรวบรวม ใช้ เปิดเผย</li>
        <li>สิทธิในการขอให้โอนย้ายข้อมูลส่วนบุคคลของท่าน</li>
        <li>สิทธิในการคัดค้าน การประมวลผลข้อมูลส่วนบุคคลของท่าน</li>
        
        <li>สิทธิในการขอให้ลบ ทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านซึ่งไม่อาจระบุตัวตนได้</li>
        <li>สิทธิในการระงับการใช้ข้อมูลส่วนบุคคลของท่าน</li>
        <li>สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้องเป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด</li>
        <li>สิทธิที่จะร้องเรียนในกรณีที่ท่านเห็นว่าถูกบริษัทหรือเจ้าหน้าที่หรือตัวแทนของบริษัทละเมิดสิทธิตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562</li>
    </ol>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        การร้องขอใด ๆ เพื่อการใช้สิทธิของท่านตามที่กล่าวข้างต้น จะต้องกระทำเป็นลายลักษณ์อักษร และบริษัทจะใช้ความพยายามอย่างดีที่สุดที่จะดำเนินการภายในระยะเวลาที่สมเหตุสมผล และไม่เกินระยะเวลาที่กฎหมายกำหนด โดยบริษัทจะปฏิบัติตามข้อกำหนดทางกฎหมายที่เกี่ยวกับสิทธิของท่านในฐานะเจ้าของข้อมูลส่วนบุคคล
    </p>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        การใช้สิทธิของท่านตามข้อ 13 อาจถูกจำกัดภายใต้กฎหมายที่เกี่ยวข้อง และมีบางกรณีที่มีเหตุจำเป็นที่เราอาจปฏิเสธหรือไม่สามารถดำเนินการตามคำขอใช้สิทธิข้างต้นของท่านได้ เช่น ต้องปฏิบัติตามกฎหมายหรือคำสั่งศาล เพื่อประโยชน์สาธารณะ การใช้สิทธิอาจละเมิดสิทธิหรือเสรีภาพของบุคคลอื่น เป็นต้น หากเราปฏิเสธคำขอข้างต้น เราจะแจ้งเหตุผลของการปฏิเสธให้ท่านทราบด้วย บริษัทขอสงวนสิทธิ์ในการคิดค่าบริการใด ๆ ที่เกี่ยวข้องและจำเป็นต่อการเข้าดำเนินการเกี่ยวกับข้อมูล ส่วนบุคคลตามที่ท่านร้องขอ
    </p>

    <!-- Section 14 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 14. การใช้คุกกี้ (Cookies)</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        “คุกกี้” (Cookies) คือ ข้อมูลที่เรา ส่งไปที่เครื่องคอมพิวเตอร์หรืออุปกรณ์ผ่านเว็บเบราว์เซอร์ (Web Browser) ของเจ้าของข้อมูลส่วนบุคคล ในกรณีที่เจ้าของข้อมูลส่วนบุคคลเข้าใช้บริการเว็บไซต์ หรือช่องทางออนไลน์อื่น ๆ ของเรา และติดตั้งข้อมูลดังกล่าวไว้ในระบบของเจ้าของข้อมูลส่วนบุคคล โดยหากมีการใช้คุกกี้ก็จะทำให้เว็บไซต์ของเรา สามารถบันทึกหรือจดจำข้อมูลของเจ้าของข้อมูลส่วนบุคคลไว้จนกว่าเจ้าของข้อมูลส่วนบุคคลจะออกจากเว็บเบราว์เซอร์ (Web Browser) หรือจนกว่าเจ้าของข้อมูลส่วนบุคคลจะทำการลบ คุกกี้นั้นเสียหรือไม่อนุญาตให้คุกกี้นั้นทำงานอีกต่อไป การใช้คุกกี้จะทำให้เจ้าของข้อมูลส่วนบุคคลได้รับความสะดวกสบายในการใช้บริการผ่านเว็บไซต์ของเรา มากขึ้น เพราะคุกกี้จะช่วยจดจำเว็บไซต์ที่เจ้าของข้อมูลส่วนบุคคลแวะหรือเยี่ยมชม ทั้งนี้ เราอาจขอความยินยอมจากท่านในการนำข้อมูลที่คุกกี้ได้บันทึกหรือเก็บรวบรวมไว้ไปใช้ในกรณี ดังต่อไปนี้
    </p>
    <ol class="mt-4 list-decimal list-inside space-y-2 text-gray-800">
        <li>เพื่อให้ระบบแสดงข้อมูลหรืออนุญาตให้เจ้าของข้อมูลส่วนบุคคลเข้าถึงบริการบางอย่างได้ เช่น การแจ้งหรือส่งคำสั่งให้กับเรา ดำเนินการ การสอบถามข้อมูลกรมธรรม์ หรือการเปลี่ยนแปลงรายละเอียดส่วนตัว เช่น รหัสผ่าน (Password), E-mail Address, Mobile Phone เป็นต้น</li>
        <li>เพื่อให้เราสามารถนำเสนอข่าวสารหรือประชาสัมพันธ์เกี่ยวกับเรา และบริการที่เป็นประโยชน์ต่อเจ้าของข้อมูลส่วนบุคคลแต่ละรายตามความเหมาะสม</li>
        <li>เพื่อใช้เป็นข้อมูลเบื้องต้นในการปรับปรุงเนื้อหาและบริการของเว็บไซต์ให้สอดคล้องกับความต้องการของเจ้าของข้อมูลส่วนบุคคลมากที่สุด</li>
        <li>เพื่อใช้ในการวิเคราะห์เชิงสถิติ หรือในกิจกรรมอื่นของเรา</li>
    </ol>
    <!-- Section 15 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 15. การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        เราจะทำการพิจารณาทบทวนนโยบายคุ้มครองข้อมูลส่วนบุคคลเป็นประจำเพื่อให้สอดคล้องกับแนวทางปฏิบัติ และกฎหมาย ข้อบังคับที่เกี่ยวข้อง ทั้งนี้ หากมีการเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล เราจะแจ้งให้ท่านทราบถึงการแก้ไขเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคลที่สำคัญใด ๆ พร้อมกับนโยบายฉบับปรับปรุง ผ่านช่องทางที่เหมาะสม ทั้งนี้ เราขอแนะนำให้ท่านตรวจสอบการเปลี่ยนแปลงนโยบาย ฉบับนี้เป็นระยะ ๆ
    </p>

    <!-- Section 16 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 16. สิทธิเชื่อมต่อไปยังเว็บไซต์ของบุคคลภายนอก</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ในการใช้บริการแอบพลิเคชันหรือเว็บไซต์ของเรา อาจมีลิงก์เชื่อมต่อไปยังเครือข่ายสังคมออนไลน์แพลตฟอร์ม และเว็บไซต์อื่นที่มีบุคคลภายนอกเป็นผู้ดำเนินการ เราพยายามที่จะเชื่อมต่อไปยังเว็บไซต์ที่มีมาตรฐานในการคุ้มครองข้อมูลส่วนบุคคลเท่านั้น อย่างไรก็ตาม เราไม่สามารถรับผิดชอบในเนื้อหาหรือมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์อื่นนั้น เว้นแต่จะกำหนดไว้เป็นประการอื่น ข้อมูลส่วนบุคคลใดที่ท่านให้แก่เว็บไซต์ของบุคคลภายนอกนั้นจะถูกเก็บรวบรวมโดยบุคคลดังกล่าวและอยู่ภายใต้ประกาศ / นโยบายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลของบุคคลภายนอกดังกล่าว (หากมี) ในกรณีเช่นว่านี้ เราไม่อาจควบคุมและไม่อาจรับผิดชอบในการใช้ข้อมูลส่วนบุคคลของคุณโดยบุคคลภายนอกดังกล่าว
    </p>

    <!-- Section 17 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 17. ช่องทางการติดต่อ</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ในกรณีที่ท่านมีข้อสงสัยหรือข้อเสนอแนะเกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคลหรือการปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ เรายินดีตอบข้อสงสัย และรับฟังข้อเสนอแนะของท่าน โดยท่านสามารถติดต่อกับบริษัทได้ตามสถานที่ติดต่อ ดังนี้ หากท่านเห็นว่าการประมวลผลข้อมูลส่วนบุคคลของท่านไม่เป็นไปตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562 ท่านมีสิทธิที่จะร้องเรียนไปยังเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
    </p>

    <table class="w-full mt-6 bg-white border border-gray-200 divide-y divide-gray-200">
        <thead class="bg-gray-50">
            <tr>
                <th colspan="2" class="px-6 py-3 text-left text-lg font-bold text-gray-900 notosan">
                    รายละเอียดของผู้ควบคุมข้อมูลส่วนบุคคล (Data Controller)</th>
            </tr>
        </thead>
        <tbody class="bg-white divide-y divide-gray-200">
            <tr class="hover:bg-gray-50">
                <td class="px-6 py-4 font-semibold text-gray-800">ชื่อ</td>
                <td class="px-6 py-4 text-gray-800">บริษัท เดอะกู้ดเชฟเพิร์ด จำกัด</td>
            </tr>
            <tr class="hover:bg-gray-50">
                <td class="px-6 py-4 font-semibold text-gray-800">สถานที่ติดต่อ</td>
                <td class="px-6 py-4 text-gray-800">56/203 หมู่ 2 ต.คูคต อ.ลำลูกกา จ.ปทุมธานี</td>
            </tr>
            <tr class="hover:bg-gray-50">
                <td class="px-6 py-4 font-semibold text-gray-800">โทรศัพท์</td>
                <td class="px-6 py-4 text-gray-800">064-947-4241</td>
            </tr>
            <tr class="hover:bg-gray-50">
                <td class="px-6 py-4 font-semibold text-gray-800">อีเมล</td>
                <td class="px-6 py-4 text-gray-800">dpo@mysamt.com</td>
            </tr>
        </tbody>
    </table>
    <!-- Section 18 -->
    <h3 class="notosan mt-8 text-xl font-semibold text-gray-900">ข้อ 18. กฎหมายที่ใช้บังคับ</h3>
    <p class="mt-4 text-base leading-relaxed text-gray-800">
        ท่านรับทราบและตกลงให้นโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ อยู่ภายใต้การบังคับและตีความตามกฎหมายไทย และศาลไทยเป็นผู้มีอำนาจในการพิจารณาข้อพิพาทใดที่อาจเกิดขึ้น
    </p>

    <!-- Contact Alert -->
    <div class="mt-8 mb-8 bg-rose-50 border-l-4 border-rose-400 p-4 rounded">
        <p class="font-semibold text-rose-800">Contact</p>
        <p class="mt-1 text-gray-800">
            Website <a href="https://www.ห้องซ้อม.com" class="text-rose-600 hover:underline">ห้องซ้อม.com</a> / Line:
            <span class="font-medium">@770zynfo</span>
        </p>
    </div>
</div>
{% endblock %}